# Import Pandas Library
- Read the Titanic dataset into a DataFrame

In [2]:
import pandas as pd
df = pd.read_csv('titanic_dataset_train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 1. How Big is the Dataset?

In [3]:
df.shape

(891, 12)

# 2. How the Data Looks Like?

In [4]:
df.head()   # Display first 5 rows
df.tail()   # Display last 5 rows
df.sample(5) # Display 5 random rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
561,562,0,3,"Sivic, Mr. Husein",male,40.00,0,0,349251,7.8958,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.00,1,0,345763,18.0000,NaN,S
340,341,1,2,"Navratil, Master. Edmond Roger",male,2.00,1,1,230080,26.0000,F2,S
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
357,358,0,2,"Funk, Miss. Annie Clemmer",female,38.00,0,0,237671,13.0000,NaN,S

# 3. What is the Data Types of Each Feature? 
- (feature is a column in the dataset)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 4. Are there Missing Values in the Dataset?

In [6]:
df.isnull() # Displays True/False for missing values. 
df.isnull().sum() # Sum of missing values per column.
#df.isnull().mean() # Proportion of missing values per column.
#df.isnull().mean().sort_values(ascending=False) # Sorted proportion of missing values per column.

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# 5. Summary Statistics of *Numerical Features* or Descriptive Statistics or How does the data look mathmatically?

In [7]:
df.describe() # only for numerical features (int and float)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# 6. Summary Statistics of *Categorical Features*

In [14]:
df.describe(include=['O']) # only for categorical features (object)
# top - most frequent value
# freq - frequency of the most frequent value
# unique - number of unique values
# count - number of non-missing values



#df.describe(include='all') # for all features 
#df['Age'].describe() # describe for a specific column

                           Name   Sex  Ticket Cabin Embarked
count                       891   891     891   204      889
unique                      891     2     681   147        3
top     Braund, Mr. Owen Harris  male  347082    G6        S
freq                          1   577       7     4      644

# 7. Are there Duplicated Rows in the Dataset?
Duplicated_Rows = df.duplicated()
print("Number of Duplicated Rows: ", Duplicated_Rows.sum())

In [19]:
df.duplicated() # Returns a boolean Series denoting duplicate rows.
df.duplicated().sum() # Number of duplicated rows

0

# 8. Coorelation between Numerical Features

- What is correlation? 
Coorelation is a statistical measure that describes the extent to which two variables change together. It indicates the strength and direction of a linear relationship between two numerical features. The correlation coefficient ranges from -1 to +1, where:
  - +1 indicates a perfect positive correlation (as one variable increases, the other also increases).
  - -1 indicates a perfect negative correlation (as one variable increases, the other decreases).

- What is method parameter in df.corr() function?
The method parameter in the df.corr() function specifies the method to be used for calculating the correlation between numerical features. The available methods are:
  - 'pearson': This is the default method and calculates the Pearson correlation coefficient, which measures the linear relationship between two continuous variables.
  - 'spearman': This method calculates the Spearman rank correlation coefficient, which assesses how well the relationship between two variables can be described using a monotonic function. It is suitable for ordinal data or non-linear relationships.
  - 'kendall': This method calculates the Kendall tau correlation coefficient, which measures the ordinal association between two variables. It is also suitable for ordinal data and is less sensitive to outliers compared to Pearson correlation.

- What is numeric_only parameter in df.corr() function?
The numeric_only parameter tells pandas whether to use only numeric columns when calculating correlation.
`numeric_only=True` → use only numbers (ignore text, dates, etc.)
`numeric_only=False` → try to include all columns (may cause errors if non-numeric data exists)
It helps avoid errors when your DataFrame has non-numeric data.

**color-coded correlation table (heatmap style)**

`.style.background_gradient(...)` → .style is an accessor whcih adds colors to the table, background_gradient() is a method which it styles the output.

`cmap='coolwarm'` → it’s a parameter that specifies the color map to use for the gradient. 'coolwarm' is a popular choice that uses a gradient from cool colors (blue) to warm colors (red).

- Red = strong positive correlation

- Blue = strong negative correlation

- White/light = weak or no correlation

Together, it shows a color-coded correlation table (heatmap style) that makes relationships easy to see at a glance.

In [27]:
df.corr(numeric_only=True) # Correlation between numerical features
df.corr(method='pearson', numeric_only=True) # Pearson correlation (default)
df.corr(method='spearman', numeric_only=True) # Spearman correlation
df.corr(method='kendall', numeric_only=True) # Kendall correlation

df.corr(numeric_only=True).style.background_gradient(cmap='coolwarm') # Heatmap style correlation matrix